OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf819.h
extern __at(0x009F) volatile __ADCON1bits_t ADCON1bits;

#define _PCFG0                  0x01
#define _PCFG1                  0x02
#define _PCFG2                  0x04
#define _PCFG3                  0x08
#define _ADCS2                  0x40
#define _ADFM                   0x80

//==============================================================================

extern __at(0x010C) __sfr EEDATA;
extern __at(0x010D) __sfr EEADR;
extern __at(0x010E) __sfr EEDATH;
extern __at(0x010F) __sfr EEADRH;

//==============================================================================
//        EECON1 Bits

extern __at(0x018C) __sfr EECON1;

typedef struct
  {
  unsigned RD                   : 1;
  unsigned WR                   : 1;
  unsigned WREN                 : 1;
  unsigned WRERR                : 1;
  unsigned FREE                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned EEPGD                : 1;
  } __EECON1bits_t;

extern __at(0x018C) volatile __EECON1bits_t EECON1bits;

#define _RD                     0x01
#define _WR                     0x02
#define _WREN                   0x04
#define _WRERR                  0x08
#define _FREE                   0x10
#define _EEPGD                  0x80

//==============================================================================

extern __at(0x018D) __sfr EECON2;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG                 0x2007

//----------------------------- CONFIG Options -------------------------------

#define _FOSC_LP                0x3FEC  // LP oscillator.
#define _LP_OSC                 0x3FEC  // LP oscillator.
#define _FOSC_XT                0x3FED  // XT oscillator.
#define _XT_OSC                 0x3FED  // XT oscillator.
#define _FOSC_HS                0x3FEE  // HS oscillator.
#define _HS_OSC                 0x3FEE  // HS oscillator.
#define _FOSC_EC                0x3FEF  // EXTCLK; port I/O function on RA6/OSC2/CLKO pin.
#define _EXTCLK                 0x3FEF  // EXTCLK; port I/O function on RA6/OSC2/CLKO pin.
#define _FOSC_INTOSCIO          0x3FFC  // INTRC oscillator; port I/O function on both RA6/OSC2/CLKO pin and RA7/OSC1/CLKI pin.
#define _INTRC_IO               0x3FFC  // INTRC oscillator; port I/O function on both RA6/OSC2/CLKO pin and RA7/OSC1/CLKI pin.
#define _FOSC_INTOSCCLK         0x3FFD  // INTRC oscillator; CLKO function on RA6/OSC2/CLKO pin and port I/O function on RA7/OSC1/CLKI pin.
#define _INTRC_CLKOUT           0x3FFD  // INTRC oscillator; CLKO function on RA6/OSC2/CLKO pin and port I/O function on RA7/OSC1/CLKI pin.
#define _FOSC_EXTRCIO           0x3FFE  // EXTRC oscillator; port I/O function on RA6/OSC2/CLKO pin.
#define _EXTRC_IO               0x3FFE  // EXTRC oscillator; port I/O function on RA6/OSC2/CLKO pin.
#define _FOSC_EXTRCCLK          0x3FFF  // EXTRC oscillator; CLKO function on RA6/OSC2/CLKO pin.
#define _EXTRC_CLKOUT           0x3FFF  // EXTRC oscillator; CLKO function on RA6/OSC2/CLKO pin.
#define _WDTE_OFF               0x3FFB  // WDT disabled.
#define _WDT_OFF                0x3FFB  // WDT disabled.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FF7  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _MCLRE_OFF              0x3FDF  // RA5/MCLR/VPP pin function is digital I/O, MCLR internally tied to VDD.
#define _MCLR_OFF               0x3FDF  // RA5/MCLR/VPP pin function is digital I/O, MCLR internally tied to VDD.
#define _MCLRE_ON               0x3FFF  // RA5/MCLR/VPP pin function is MCLR.
#define _MCLR_ON                0x3FFF  // RA5/MCLR/VPP pin function is MCLR.
#define _BOREN_OFF              0x3FBF  // BOR disabled.
#define _BODEN_OFF              0x3FBF  // BOR disabled.
#define _BOREN_ON               0x3FFF  // BOR enabled.
#define _BODEN_ON               0x3FFF  // BOR enabled.
#define _LVP_OFF                0x3F7F  // RB3/PGM pin has digital I/O function, HV on MCLR must be used for programming.
#define _LVP_ON                 0x3FFF  // RB3/PGM pin has PGM function, Low-Voltage Programming enabled.
#define _CPD_ON                 0x3EFF  // Data EE memory locations code-protected.
#define _CPD_OFF                0x3FFF  // Code protection off.
#define _WRT_1536               0x39FF  // 0000h to 05FFh write-protected, 0600h to 07FFh may be modified by EECON control.
#define _WRT_ENABLE_1536        0x39FF  // 0000h to 05FFh write-protected, 0600h to 07FFh may be modified by EECON control.
#define _WRT_1024               0x3BFF  // 0000h to 03FFh write-protected, 0400h to 07FFh may be modified by EECON control.
#define _WRT_ENABLE_1024        0x3BFF  // 0000h to 03FFh write-protected, 0400h to 07FFh may be modified by EECON control.
#define _WRT_512                0x3DFF  // 0000h to 01FFh write-protected, 0200h to 07FFh may be modified by EECON control.
#define _WRT_ENABLE_512         0x3DFF  // 0000h to 01FFh write-protected, 0200h to 07FFh may be modified by EECON control.
#define _WRT_OFF                0x3FFF  // Write protection off.
#define _WRT_ENABLE_OFF         0x3FFF  // Write protection off.
#define _DEBUG_ON               0x37FF  // In-Circuit Debugger enabled, RB6 and RB7 are dedicated to the debugger.
#define _DEBUG_OFF              0x3FFF  // In-Circuit Debugger disabled, RB6 and RB7 are general purpose I/O pins.
#define _CCPMX_RB3              0x2FFF  // CCP1 function on RB3.
#define _CCP1_RB3               0x2FFF  // CCP1 function on RB3.
#define _CCPMX_RB2              0x3FFF  // CCP1 function on RB2.
#define _CCP1_RB2               0x3FFF  // CCP1 function on RB2.
#define _CP_ON                  0x1FFF  // All memory locations code-protected.
#define _CP_ALL                 0x1FFF  // All memory locations code-protected.
#define _CP_OFF                 0x3FFF  // Code protection off.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

